// Реализовать программу, которая определяет частоту используемых символов. Текст должен браться из файла. Размер файла до 10000 символов.

#include <stdio.h>
#include <iostream>
#define MAXCHAR 10000

using namespace std;

char symbol[44] = {"а","б","в","г","д","е","ё","ж","з","и","й","к","л","м","н","о","п","р","с","т","у","ф","х","ц","ш","щ","ъ","ы","ь","э","ю","я",".",",",";","...",":","–","\"","(",")","?","!"}; // Перечислить распространенные символы 

int main(){
    FILE *fp;
    char str[MAXCHAR];
    char* manifest = "manifest.txt"; // Взять отрывок из книги инженера Microsoft и автора термина "виртуальная реальность" Джарона Ланье "Вы не гаджет. Манифест"
 
    fp = fopen(manifest, "r"); // Создать уведомление на случай неверного местоположения файла или его отсутствия
    if (fp == NULL){
        printf("Could not open file %s",manifest);
        return 1;
    }

    for (int i = 0; i<44; i++) { // Подсчитать количество вхождений в текст элемента ряда symbol с i-м индексом
        size_t n = std::count(manifest.begin(), s.end(), symbol[i]);
    }

    return 0;
}

