// Сделать программу, которая заполняет массив char размером 1000. Заполнить массив случайными символами (не цифрами) и вывести в консоль.

#include <stdio.h>
#include <iostream>
#define RAND_MAX 33 // Определить "потолок" для генератора случайных чисел rand()

using namespace std;

int i, j = 0, k; 
char array[1000];
string alphabet[33] = {"а","б","в","г","д","е","ё","ж","з","и","й","к","л","м","н","о","п","р","с","т","у","ф","х","ц","ш","щ","ъ","ы","ь","э","ю","я"};

int main() {
    for (i = 0; i<1000; i++) { // Генерировать случайные индексы алфавитного вектора в пределах диапазона
        j = rand();
        array[i]=alphabet[j]; // Присваивать элементу конечного массива j-е значение вектора
    }
    
    cout << "Массив случайных символов: \n";
    
    for (i = 0; i < 1000; i++){ // Отобразить результирующий массив построчно
        cout << array[i] << '\n';
    }
    return 0;
}